//هي اللي بتتحكم بالحركة
// نفس السي اس اس انلاين لوكالي و اكستيرنال
function btnshow(){
    console.document.getElementById('1').innerText=document
    document.getElementById('2').style.color='red'
}
//نقدر نعمل جيت اليمنتس حسب الاسم او كلاس اليمنس لانه ممكن يشتركو اكثر من اليمنت بالكلاس او الهم نفس الاسم
//التايب سانسيتيف let ,var بس هدول مش مستخدمات الفار بس اللي مش مستخدمه
function testt(){
    let x=0;
    console.log(x);
    x='hi';
    console.log(x);
    x='مناااااااار'
    console.log(x);
}
//سكرين بقدر اجيب معلومات الشاشة اللي حينعرض عليها الويب
//الكتابة على البيج نفسها و الها احتمالين الاول، نغير الكونتنت عن طريق بوتون او عن طريق الدكيومينت . تايب
//انه الصور ما بكونو على السيرفر الايفكت بطول ليغير لون الصورة فالافكت ما حيبين مثل ما بدي لانو البراوزر بجيب الصور لما بدها تنعرض ، طيب في طريقة نجيب الصور بسرعة اونلود و الانيت فنكشن بنعرف اوبجكت جديد
//x=nwe image(x,y)
//x.sours=....
//نحطها بفنكشن و هون بنصير نستخدم الاكس او الفنكشن اللي بدنا نستعمله
//الهايد و الشو اله طريقتين اما فيزيبال او ديسبلاي

//كل فنكشن مربوطة في اكشن ، بكون جواها اوبجكت اسمو افينت
//